mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE986x_DFP.1.4.2.pdsc
        <device Dname="TLE9867QXW20">
          <processor Dclock="24000000" />
          <compile header="Device/Include/tle986x.h" define="TLE9867QXW20;RTE_DEVICE_BF_STEP" />
          <debug svd="SVD/TLE986x.svd" />
          <memory id="IROM1" start="0x11000000" size="0xEFFC" startup="1" default="1" />
			<memory     id="IROM2"                      start="0x1100EFFC"  size="0x1004"     startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"     init   ="0"   default="1"/>
      <memory     id="IRAM2"                      start="0x18000000"  size="0x14"       init   ="0"   default="1"/>
          <algorithm name="Flash/TLE9867.FLM" start="0x11000000" size="0xF000" default="1" />
          <algorithm name="Flash/TLE9867_EEP.FLM" start="0x1100F000" size="0x1000" default="1" />
          <book name="Documents/TLE986xQX-Users-Manual-14-Infineon.pdf" title="TLE986x Series Reference Manual" />
          <book name="Documents/TLE986xQX-BootROM-User-Manual-14-Infineon.pdf" title="TLE986x BF-Step Series BootROM Manual" />
          <book name="Documents/TLE9867QXW20-BF-Data-Sheet-11-Infineon.pdf" title="TLE9867QXW20 Data Sheet - BF-Step" />
          <book name="Documents/html/index.html" title="SDK Help" />
          <feature type="ADC" n="1" m="10" />
          <feature type="ADC" n="1" m="8" />
          <feature type="IOs" n="11" />
        </device>
        
        <device Dname="TLE9869QXA20">
          <processor Dclock="24000000" />
          <compile header="Device/Include/tle986x.h" define="TLE9869QXA20" />
          <debug svd="SVD/TLE986x.svd" />
          <memory id="IROM1" start="0x11000000" size="0x1EFFC" startup="1" default="1" />
			<memory     id="IROM2"                      start="0x1101EFFC"  size="0x1004"      startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"      init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x10"       init   ="0"   default="1"/>
          <algorithm name="Flash/TLE9869.FLM" start="0x11000000" size="0x1F000" default="1" />
          <algorithm name="Flash/TLE9869_EEP.FLM" start="0x1101F000" size="0x1000" default="1" />
          <book name="Documents/TLE986xQX-Users-Manual-14-Infineon.pdf" title="TLE986x Series Reference Manual" />
          <book name="Documents/TLE986xQX-BootROM-User-Manual-13-Infineon.pdf" title="TLE986x BE-Step Series BootROM Manual" />
          <book name="Documents/TLE986xQX-BootROM-User-Manual-14-Infineon.pdf" title="TLE986x BF-Step Series BootROM Manual" />
          <book name="Documents/TLE9869QXA20-Data-Sheet-10-Infineon.pdf" title="TLE9869QXA20 Data Sheet - BE-Step" />
          <book name="Documents/TLE9869QXA20-BF-Data-Sheet-10-Infineon.pdf" title="TLE9869QXA20 Data Sheet - BF-Step" />
          <book name="Documents/html/index.html" title="SDK Help" />
          <feature type="ADC" n="1" m="10" />
          <feature type="ADC" n="1" m="8" />
          <feature type="IOs" n="11" />
        </device>
      </subFamily>
    </family>
  </devices>
  
  <conditions>
    <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="ADC">
      <description>IF ADC1 is selected, ADC2 and BDRV must also be selected</description>
      <require Cclass="Device" Cgroup="SDK" Csub="ADC1" />
      <require Cclass="Device" Cgroup="SDK" Csub="ADC2" />
      <require condition="TLE986x CMSIS Device" />
    </condition>
    
    <condition id="Only ConfigWizard">
      <!-- Condition for ConfigWizard_v1.x -->
      <description>If ConfigWizard_v1.x is selected, version 2.x must not be selected</description>
      <deny Cclass="Device" Cgroup="ConfigWizard_v2" Csub="" />
      <require Dvendor="Infineon:7" Dname="TLE986*QX*" />
    </condition>
    
    <condition id="Only ConfigWizard_v2">
      <!-- Condition for ConfigWizard_v2.x -->
      <description>If ConfigWizard_v2.x is selected, version 1.x must not be selected</description>
      <deny Cclass="Device" Cgroup="ConfigWizard" Csub="" />
      <require Dvendor="Infineon:7" Dname="TLE986*QX*" />
    </condition>
    
    <condition id="TLE986x CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass="CMSIS" Cgroup="CORE" Csub="" />
      <require Cclass="Device" Cgroup="SDK" Csub="SCU" />
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1" />
      <require Cclass="Device" Cgroup="SDK" Csub="ISR" />
      <require Cclass="Device" Cgroup="SDK" Csub="INT" />
      <require Cclass="Device" Cgroup="SDK" Csub="LIN" />
      <require Cclass="Device" Cgroup="SDK" Csub="PORT" />
      <require Cclass="Device" Cgroup="SDK" Csub="PMU" />
      <require Dvendor="Infineon:7" Dname="TLE986*QX*" />
      <require Tcompiler="ARMCC" />
      <accept Cclass="Device" Cgroup="ConfigWizard" Csub="" />
      <accept Cclass="Device" Cgroup="ConfigWizard_v2" Csub="" />
    </condition>
    
    <condition id="TLE986x">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass="CMSIS" Cgroup="CORE" Csub="" />
      <require Dvendor="Infineon:7" Dname="TLE986*" /> <!-- "?" is the Wild-card for a single character; this excludes TLE9879-2QXA40 -->
      <require Tcompiler="ARMCC" />
    </condition>
    
    <condition id="TLE986x_20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x 24MHz device series</description>
      <require Cclass="CMSIS" Cgroup="CORE" Csub="" />
      <require Dvendor="Infineon:7" Dname="TLE986*QX*20" />
      <require Tcompiler="ARMCC" />
    </condition>
    
    <condition id="TLE986x_40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x 40MHz device series</description>
      <require Cclass="CMSIS" Cgroup="CORE" Csub="" />
      <require Dvendor="Infineon:7" Dname="TLE986*QX*40" />
      <require Tcompiler="ARMCC" />
    </condition>
    
