mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE986x_DFP.1.4.2.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.1.4" condition="TLE986x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_MON
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/mon.h" version="0.1.4" />
        <file category="source" attr="config" name="Device/SDK/src/mon.c" version="0.1.4" />
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="PORT" Cversion="0.5.5" condition="TLE986x CMSIS Device">
      <description>GPIO Ports (PORT) driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PORT
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/port.h" version="0.5.5" />
        <file category="source" attr="config" name="Device/SDK/src/port.c" version="0.5.5" />
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="SSC" Cversion="0.1.6" condition="TLE986x CMSIS Device">
      <description>High Speed Synchronous Serial Interface 1 and 2 (SSC) driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SSC
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/ssc.h" version="0.1.6"/>
        <file category="source" attr="config" name="Device/SDK/src/ssc.c" version="0.1.6"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" Cversion="0.1.7" condition="TLE986x CMSIS Device">
      <description>Timer2 and Timer21 (TIMER2x) driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER2X
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/timer2x.h" version="0.1.7" />
        <file category="source" attr="config" name="Device/SDK/src/timer2x.c" version="0.1.7" />
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="TIMER3" Cversion="0.1.5" condition="TLE986x CMSIS Device">
      <description>Timer3 (TIMER3) driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER3
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/timer3.h" version="0.1.5" />
        <file category="source" attr="config" name="Device/SDK/src/timer3.c" version="0.1.5" />
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="UART" Cversion="0.1.8" condition="TLE986x CMSIS Device">
      <description>UART1 and UART2 (UART) driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_UART
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/uart.h" version="0.1.8" />
        <file category="source" attr="config" name="Device/SDK/src/uart.c" version="0.1.8" />
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="DMA" Cversion="0.1.7" condition="TLE986x CMSIS Device">
      <description>DMA driver for TLE986x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_DMA
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/dma.h" version="0.1.7" />
        <file category="source" attr="config" name="Device/SDK/src/dma.c" version="0.1.7" />
      </files>
    </component>
  </components>
  
  <examples>
    <!-- TLE9869 Examples -->
	
    <example name="PMU Power Saving SleepMode" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/PMU_POWER_SAVING_SLEEP_MODE_EXAMPLE_TLE986X/">
      <description>Power Saving Modes - Sleep Mode</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <board name="TLE986x EvalBoard" vendor="Infineon" />
      <project>
        <environment name="uv" load="PMU_PowerSaving_SleepMode.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="PMU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="Blinky Running Lights" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/BLINKY_RUNNING_LIGHTS_EXAMPLE_TLE986X/">
      <description>Blinky - Running Lights</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="BLINKY_RunningLights.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="PMU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/BLINKY_EXAMPLE_TLE986X/">
      <description>Blinky - blinks LED1</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="Blinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

