mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE986x_DFP.1.4.2.pdsc
    <example name="NVM Programming with RAM branch" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/NVM_RAM_BRANCH_EXAMPLE_TLE986X/">
      <description>NVM Programming with RAM Branch</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="NVM_RAM_BRANCH.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="NVM Protection" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/NVM_PROTECTION_EXAMPLE_TLE986X/">
      <description>Flash Page Write Protection</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="NVM_PROTECTION.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="ADC2 VS measurement" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/ADC2_VS_EXAMPLE_TLE986X/">
      <description>ADC2 VS Measurement</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="ADC2_VS.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BDRV" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC2" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="ADC1 Seq" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/ADC1_POTI_SEQ_EXAMPLE_TLE986X/">
      <description>ADC1 in Sequencer Mode reading in the Poti at Channel 4</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="ADC1_POTI_SEQ.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="ADC1 EIM" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/ADC1_POTI_EIM_EXAMPLE_TLE986X/">
      <description>ADC1 with Exceptional Interrupt Mode reading in the Poti at Channel 4</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="ADC1_POTI_EIM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="ADC1 ESM" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/ADC1_POTI_ESM_EXAMPLE_TLE986X/">
      <description>ADC1 with Exceptional Sequencer Mode reading in the Poti at Channel 4</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="ADC1_POTI_ESM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="MON" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="TIMER2 blink" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/TIMER2_BLINK_EXAMPLE_TLE986X/">
      <description>TIMER2 Blinking</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="TIMER2_BLINK.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="TIMER2 PWM capture" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/TIMER2_PWM_CAPTURE_EXAMPLE_TLE986X/">
      <description>TIMER2 PWM Duty Cycle and Period Measurement</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="Timer2_PWM_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
