mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE986x_DFP.1.4.2.pdsc
    <example name="GPT12E.T3 reload" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/GPT12E_T3_RELOAD_EXAMPLE_TLE986X/">
      <description>GPT12E Timer3 reloaded by Timer2</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="GPT12E_T3_LOAD.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="GPT12E.T3 concatenated" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/GPT12E_T3_CONCAT_EXAMPLE_TLE986X/">
      <description>Timer2 and Timer3 as 32bit Timer</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="GPT12E_T3_CONCAT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="UART1 send" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/UART1_SEND_EXAMPLE_TLE986X/">
      <description>UART1 sends data over LIN Transceiver</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="UART1_SEND.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="SSC1 send" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/SSC1_SEND_EXAMPLE_TLE986X/">
      <description>SSC1 sends data as SPI Master</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="SSC1_SEND.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="SSC" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="SSC1 to SSC2" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/SSC1_TO_SSC2_EXAMPLE_TLE986X/">
      <description>SSC1 sends to SSC2</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="SSC1_2_SSC2.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="SSC" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="CCU6 PWM generation" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/CCU6_PWM_EXAMPLE_TLE986X/">
      <description>CCU6 generates PWM signals</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="CCU6_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="CCU6 synch. ADC1" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/CCU6_ADC1_EXAMPLE_TLE986X/">
      <description>PWM synchroneous ADC measurement, the Poti at Channel 4 adjusts the PWM</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="CCU6_ADC1.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
