mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE986x_DFP.1.4.2.pdsc
    <example name="UART2 TTY" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/UART2_TTY_EXAMPLE_TLE986X/">
      <description>UART2 sends printf messages</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="UART2_TTY.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="DC-Motor" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/BDRV_EMO_DC_EXAMPLE_TLE986X/">
      <description>simple DC-Motor run</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="BDRV_EMO_DC.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BDRV" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="DC-Motor + LIN" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/BDRV_EMO_DC_LIN_EXAMPLE_TLE986X/">
      <description>simple DC-Motor controlled over LIN</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="BDRV_EMO_DC_LIN.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6" />
        <component Cclass="Device" Cgroup="SDK" Csub="BDRV" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="LIN" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="LIN Slave" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/LIN_SLAVE_EXAMPLE_TLE986X/">
      <description>running the IHR LIN LLD in a LIN Slave configuration</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="LIN_Slave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="LIN" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="LIN Master" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/LIN_MASTER_EXAMPLE_TLE986X/">
      <description>running the IHR LIN LLD in a LIN Master configuration</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="LIN_Master.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="LIN" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="NVM Data Flash Handling" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/NVM_DATA_FLASH_HANDLING_EXAMPLE_TLE986X/">
      <description>NVM Data Flash page write with error handling</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="NVM_Data_Flash_Handling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC2" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
