mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE986x_DFP.1.4.2.pdsc
    <example name="DMA UART TTY" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/DMA_UART_TTY_EXAMPLE_TLE986X/">
      <description>UART2 sends data triggered by DMA</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="DMA_UART_TTY.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="DMA" />
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" />
        <component Cclass="Device" Cgroup="SDK" Csub="MON" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="DMA ADC1 Sequence" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/DMA_ADC1_SEQ_EXAMPLE_TLE986X/">
      <description>ADC1 triggers DMA after sequence is done</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="DMA_ADC1_Seq.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <component Cclass="Device" Cgroup="SDK" Csub="DMA" />
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1" />
        <component Cclass="Device" Cgroup="SDK" Csub="CSA" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="DMA SPI" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/DMA_SPI_EXAMPLE_TLE986X/">
      <description>Sends data through SPI using DMA</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="DMA_SPI.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <component Cclass="Device" Cgroup="SDK" Csub="DMA" />
        <component Cclass="Device" Cgroup="SDK" Csub="SSC" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="DMA SCATTER-GATHER" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/DMA_CH0_SCTGTH_EXAMPLE_TLE986X/">
      <description>Multiple Memory Copy using DMA.Ch0 Scatter-Gather Mode</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="DMA_Ch0_SctGth.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <component Cclass="Device" Cgroup="SDK" Csub="DMA" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="LIN Synch + Autobaud" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/LIN_SYNCH_AUTOBAUD_EXAMPLE_TLE986X/">
      <description>LIN Synch Break recognition + Autobaud detection</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="LIN_Sync_Autobaud.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="LIN" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="UART" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
    
    <example name="GPT12E Capture" doc="Abstract.txt" folder="Boards/Infineon/TLE9869_EvalKit/GPT12E_INPUT_CAPTURE_EXAMPLE_TLE986X/">
      <description>GPT12E.T2 captures input signal</description>
      <board name="TLE9869 EvalKit" vendor="Infineon" />
      <project>
        <environment name="uv" load="GPT12E_Capture_T2_T3.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <component Cclass="Device" Cgroup="SDK" Csub="SCU" />
        <component Cclass="Device" Cgroup="SDK" Csub="ISR" />
        <component Cclass="Device" Cgroup="SDK" Csub="INT" />
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" />
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" />
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1" />
        <component Cclass="Device" Cgroup="SDK" Csub="PORT" />
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" />
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

  </examples>
  
</package>
